trade_exp/src/InformationRegisters/ЖурналРаботыМобильногоУстройства/ЖурналРаботыМобильногоУстройства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="350a385f-0914-48e1-8d59-1ffdd7ddbe0e">
  <name>ЖурналРаботыМобильногоУстройства</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="8dc76def-fdde-4d6d-9712-282deb9934a2">
    <name>Текст</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="df13fa0f-9ec7-467c-b511-57406f52a210">
    <name>ОписаниеОшибки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="db7b51ab-b8a5-46bd-898b-60c60040530f">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2bee8abf-8bd5-4e3c-aad2-c33172189643">
    <name>ТипСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="01747bf0-2a92-4dca-9f96-7f93d6af91ab">
    <name>Версия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/CommonModules/ОбменСМобильнымПриложениемВодителейСервер/Module.bsl
#Область ПодпискаНаСобытие
Процедура ОбменСМобильнымПриложениемВодителйПроведениеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ТипОбъекта = ТипЗнч(Источник);
	
	Если ТипОбъекта = Тип("ДокументОбъект.ЗаданиеНаПеревозкуРейс") Тогда
		Если ЗначениеЗаполнено(Источник.Водитель) Тогда
			УзелВодителя= ПланыОбмена.МобильноеПриложениеВодителей.ПолучитьУзелВодителя(Источник.Водитель);
			
			Если ЗначениеЗаполнено(УзелВодителя) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзелВодителя, Источник.Ссылка);
				
				Для Каждого Основание Из Источник.Основания Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(УзелВодителя, Основание.Документ);	
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбменСМобильнымПриложениемВодителйЗаписьПриЗаписи(Источник, Отказ, Замещение) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ТипОбъекта = ТипЗнч(Источник);
	
	Если ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.СтатусыВодителей") Тогда
		Водитель= Неопределено;
		Для Каждого Отбор Из Источник.Отбор Цикл
			Если Отбор.ПутьКДанным = "Водитель" Тогда
				Водитель=  Отбор.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Водитель) Тогда
			УзелВодителя= ПланыОбмена.МобильноеПриложениеВодителей.ПолучитьУзелВодителя(Водитель);
			
			Если ЗначениеЗаполнено(УзелВодителя) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзелВодителя, Источник);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбменСМобильнымПриложениемВодителейУдалениеОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ТипОбъекта = ТипЗнч(Источник);
	Если ТипОбъекта = Тип("ДокументОбъект.ЗаданиеНаПеревозкуРейс") Тогда
		Если ЗначениеЗаполнено(Источник.Водитель) Тогда
			УзелВодителя= ПланыОбмена.МобильноеПриложениеВодителей.ПолучитьУзелВодителя(Источник.Водитель);
			Если ЗначениеЗаполнено(УзелВодителя) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзелВодителя, Источник.Ссылка);
				Для Каждого Основание Из Источник.Основания Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(УзелВодителя, Основание.Документ);	
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.ЗаказНаДоставкуКлиенту") Тогда
		//найти рейс
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуРейсОснования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеНаПеревозкуРейс.Основания КАК ЗаданиеНаПеревозкуРейсОснования
		|ГДЕ
		|	ЗаданиеНаПеревозкуРейсОснования.Документ = &Документ
		|	И ЗаданиеНаПеревозкуРейсОснования.Ссылка.Проведен = ИСТИНА
		|	И ЗаданиеНаПеревозкуРейсОснования.Ссылка.ПометкаУдаления = ЛОЖЬ";
		Запрос.УстановитьПараметр("Документ", Источник.Ссылка);		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Рейс = Неопределено;
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			 Рейс = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
		
		Если Рейс<>Неопределено Тогда
			//найти водителя
			УзелВодителя= ПланыОбмена.МобильноеПриложениеВодителей.ПолучитьУзелВодителя(Рейс.Водитель);
			//зарегистрировать изменения
			Если ЗначениеЗаполнено(УзелВодителя) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзелВодителя, Источник.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ЗаписьОшибок

Процедура ЗарегестрироватьОшибку(Сотрудник, Текст, ОписаниеОшибки="") Экспорт
	ТипСообщения= Перечисления.ТипыСообщенийМобильногоПриложения.Ошибка;
	
	ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , , Текст);
	
	ДобавитьЗаписьВЖурнал(Сотрудник, ТипСообщения, Текст, ОписаниеОшибки);
КонецПроцедуры

Процедура ЗарегестрироватьИнформацию(Сотрудник, Текст) Экспорт
	ТипСообщения= Перечисления.ТипыСообщенийМобильногоПриложения.Информация;
	
	ДобавитьЗаписьВЖурнал(Сотрудник, ТипСообщения, Текст)
КонецПроцедуры

Процедура ДобавитьЗаписьВЖурнал(Водитель, ТипСообщения, Текст, ОписаниеОшибки="")
	ГСЧ= Новый ГенераторСлучайныхЧисел;
	Версия= ГСЧ.СлучайноеЧисло(0, 999);
	
	Если ТипЗнч(Водитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Сотрудник = АльтерраОбщегоНазначения.ПолучитьСотрудникаПоФизЛицу(Водитель);
	Иначе
		Сотрудник = Водитель;
	КонецЕсли;
	
	Попытка
		НоваяЗапись = РегистрыСведений.ЖурналРаботыМобильногоУстройства.СоздатьМенеджерЗаписи();
		НоваяЗапись.Сотрудник= Сотрудник;
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.ТипСообщения = ТипСообщения;
		НоваяЗапись.Текст = "ЦБ: "+Текст;
		НоваяЗапись.ОписаниеОшибки = ОписаниеОшибки;
		НоваяЗапись.Версия= Версия;
		НоваяЗапись.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("МобильноеПриложениеВодителей", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось записать ошибку ЦБ. " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
